tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "jesseduffield/lazydocker"
tap "jesseduffield/lazygit"
tap "koekeishiya/formulae"
tap "oven-sh/bun"
brew "autoconf"
brew "awscli"
brew "bat"
brew "bear"
brew "cmake"
brew "coreutils"
brew "dua-cli"
brew "emacs"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "figlet"
brew "fish"
brew "fzf"
brew "geckodriver"
brew "gh"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "gnupg"
brew "go"
brew "gotop"
brew "graphviz"
brew "hexyl"
brew "htop"
brew "httpie"
brew "hub"
brew "hyperfine"
brew "ical-buddy"
brew "imagemagick"
brew "jq"
brew "just"
brew "less"
brew "litecli"
brew "llvm"
brew "mise"
brew "mosh"
brew "mpv"
brew "mycli"
brew "neovim"
brew "nmap"
brew "numbat"
brew "parallel"
brew "pastel"
brew "pgcli"
brew "podman-compose"
brew "postgresql@14"
brew "procs"
brew "redis"
brew "rename"
brew "ripgrep"
brew "rsync"
brew "sd"
brew "shellcheck"
brew "showkey"
brew "slides"
brew "starship"
brew "stow"
brew "stylua"
brew "tldr"
brew "tmux"
brew "universal-ctags"
brew "vim"
brew "watch"
brew "watchexec"
brew "wget"
brew "wrk"
brew "xsv"
brew "youtube-dl"
brew "zsh"
brew "jesseduffield/lazydocker/lazydocker"
brew "jesseduffield/lazygit/lazygit"
brew "koekeishiya/formulae/yabai"
brew "oven-sh/bun/bun"
cask "1password"
cask "appcleaner"
cask "bartender"
cask "daisydisk"
cask "docker"
cask "firefox"
cask "google-chrome"
cask "google-chrome-canary"
cask "hammerspoon"
cask "iina"
cask "istat-menus"
cask "iterm2"
cask "keycastr"
cask "little-snitch"
cask "ngrok"
cask "numi"
cask "obsidian"
cask "postman"
cask "proxyman"
cask "qlimagesize"
cask "raycast"
cask "tableplus"
cask "textexpander"
cask "tower"
cask "visual-studio-code"
cask "wezterm"
cask "zoom"
