tap "homebrew/bundle"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "koekeishiya/formulae"
tap "nikitabobko/tap"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"
brew "ast-grep"
brew "autoconf"
brew "bat"
brew "bear"
brew "btop"
brew "cloc"
brew "cmake"
brew "coreutils"
brew "criterion"
brew "docker-compose"
brew "dua-cli"
brew "emacs"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "figlet"
brew "fish"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "go"
brew "gopls"
brew "graphviz"
brew "gum"
brew "hexyl"
brew "htop"
brew "hurl"
brew "hyperfine"
brew "ical-buddy"
brew "imagemagick"
brew "imagemagick@6"
brew "jq"
brew "just"
brew "less"
brew "llvm"
brew "mosh"
brew "mtr"
brew "mycli"
brew "neovim"
brew "nmap"
brew "numbat"
brew "parallel"
brew "pastel"
brew "pgcli"
brew "pkgconf"
brew "podman"
brew "postgresql@17"
brew "procs"
brew "ripgrep"
brew "rsync"
brew "sd"
brew "shellcheck"
brew "shfmt"
brew "showkey"
brew "slides"
brew "speedtest-cli"
brew "starship"
brew "stow"
brew "stylua"
brew "swift-format"
brew "tabiew"
brew "tidy-html5"
brew "tldr"
brew "tmux"
brew "vim"
brew "watch"
brew "watchexec"
brew "wget"
brew "wrk"
brew "xh"
brew "xmake"
brew "xsv"
brew "yazi"
brew "yt-dlp"
brew "zoxide"
brew "zsh"
brew "jesseduffield/lazygit/lazygit"
brew "qmk/qmk/qmk"
cask "1password"
cask "aerospace"
cask "appcleaner"
cask "arc"
cask "daisydisk"
cask "font-fira-code-nerd-font"
cask "google-chrome@canary"
cask "hammerspoon"
cask "iina"
cask "keycastr"
cask "obsidian"
cask "qlimagesize"
cask "raycast"
cask "tableplus"
cask "wezterm"
