tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
brew "asdf"
brew "aws-cdk"
brew "awscli"
brew "bettercap"
brew "cmake"
brew "cppcheck"
brew "dust"
brew "exiftool"
brew "ffmpeg"
brew "figlet"
brew "fzf"
brew "geckodriver"
brew "gh"
brew "ghostscript"
brew "git"
brew "gnupg"
brew "htop"
brew "httpie"
brew "hub"
brew "imagemagick"
brew "jq"
brew "mosh"
brew "mpv"
brew "neovim"
brew "nmap"
brew "pgcli"
brew "postgresql"
brew "reattach-to-user-namespace"
brew "redis"
brew "rename"
brew "rsync"
brew "shellcheck"
brew "tmux"
brew "universal-ctags"
brew "vim"
brew "watch"
brew "z"
brew "zsh"
cask "font-fira-code-nerd-font"
cask "ngrok"
