tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "koekeishiya/formulae"
brew "aws-cdk"
brew "awscli"
brew "bat"
brew "bettercap"
brew "cmake"
brew "cppcheck"
brew "dust"
brew "emacs"
brew "exa"
brew "exiftool"
brew "fd"
brew "ffmpeg"
brew "figlet"
brew "fzf"
brew "geckodriver"
brew "gh"
brew "ghostscript"
brew "git"
brew "git-delta"
brew "gnupg"
brew "go"
brew "gotop"
brew "hexyl"
brew "htop"
brew "hub"
brew "hyperfine"
brew "ical-buddy"
brew "imagemagick"
brew "jq"
brew "less"
brew "mosh"
brew "mpv"
brew "neovim"
brew "nmap"
brew "pgcli"
brew "postgresql"
brew "reattach-to-user-namespace"
brew "redis"
brew "rename"
brew "ripgrep"
brew "rsync"
brew "sd"
brew "shellcheck"
brew "starship"
brew "tmux"
brew "universal-ctags"
brew "vim"
brew "watch"
brew "wget"
brew "zsh"
brew "jesseduffield/lazygit/lazygit"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
cask "1password"
cask "appcleaner"
cask "bartender"
cask "daisydisk"
cask "firefox"
cask "font-fira-code-nerd-font"
cask "google-chrome"
cask "iina"
cask "iterm2"
cask "keycastr"
cask "launchbar"
cask "little-snitch"
cask "ngrok"
cask "numi"
cask "postman"
cask "proxyman"
cask "qlimagesize"
cask "qlstephen"
cask "tableplus"
cask "textexpander"
cask "tower"
cask "visual-studio-code"
cask "zoom"
