tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
brew "asdf"
brew "bat"
brew "bettercap"
brew "cmake"
brew "cppcheck"
brew "ctags"
brew "dust"
brew "emacs"
brew "exa"
brew "exiftool"
brew "fd"
brew "ffmpeg"
brew "figlet"
brew "fzf"
brew "geckodriver"
brew "gh"
brew "ghostscript"
brew "git"
brew "hexyl"
brew "htop"
brew "httpie"
brew "hub"
brew "hyperfine"
brew "imagemagick"
brew "jq"
brew "mosh"
brew "mpv"
brew "neovim"
brew "nmap"
brew "pgcli"
brew "pipenv"
brew "postgresql"
brew "reattach-to-user-namespace"
brew "redis"
brew "rename"
brew "ripgrep"
brew "rsync"
brew "sd"
brew "shellcheck"
brew "speedtest-cli"
brew "ssh-copy-id"
brew "tmux"
brew "vim"
brew "watch"
brew "z"
brew "zsh"
cask "font-firacode-nerd-font"
cask "iina"
cask "ngrok"
